#Оценки
#Создать список из словарей с оценками учеников разных классов школы вида [{'school_class': '4a', 'scores': [3,4,4,5,2]}, ...]
#Посчитать и вывести средний балл по всей школе.
#Посчитать и вывести средний балл по каждому классу.

list_of_ratings = [
    {'school_class': '4a', 'scores': [3,4,4,5,2],},
    {'school_class': '4b', 'scores': [2,4,3,2,5],},
    {'school_class': '4c', 'scores': [5,4,3,4,3],},
    {'school_class': '5a', 'scores': [5,4,5,3,2],},
    {'school_class': '5b', 'scores': [2,3,5,2,5],},
    {'school_class': '5c', 'scores': [5,4,3,4,5],}
]
print(list_of_ratings[0]['scores'])

